{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [1, 1], "batch_input_shape": [null, 48, 48, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_1", "filters": 32, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "filters": 32, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "filters": 32, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_4", "filters": 64, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 2048, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 7, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "softmax"}}], "keras_version": "2.2.2"}